app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT * FROM "surveys"

  def show
    @survey = Survey.find(params[:id])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 40)

  def create
    @survey = Survey.new(params[:survey])
    logger.debug @survey.to_yaml
    if @survey.questions.blank?
        #flash[:notice] = "Question must be specify:"
        render :action => 'new'
      else if @survey.save
---
SELECT * FROM "questions" WHERE ("questions".survey_id = 49)
INSERT INTO "questions" ("updated_at", "survey_id", "content", "created_at") VALUES('2010-04-02 04:40:21', 40, 'saf', '2010-04-02 04:40:21')
INSERT INTO "surveys" ("name", "updated_at", "created_at") VALUES('s2', '2010-04-02 04:40:21', '2010-04-02 04:40:21')

  def edit
    @survey = Survey.find(params[:id])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 54)

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 39)
DELETE FROM "surveys" WHERE "id" = 39